In [35]:
# Importing libraries
# -------------------
import pandas as pd

# Importing the dataset
# ---------------------
dataset = pd.read_csv('http://bit.ly/kaggletrain')

cols = dataset.columns.tolist() # column names
cols = [cols[1]] + cols[0:1] + cols[2:]
dataset = dataset[cols]
dataset = dataset.drop(["Name", "Ticket", "Cabin"], axis = 1)

#see haed data
dataset.head()

   Survived  PassengerId  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0         0            1       3    male  22.0      1      0   7.2500        S
1         1            2       1  female  38.0      1      0  71.2833        C
2         1            3       3  female  26.0      0      0   7.9250        S
3         1            4       1  female  35.0      1      0  53.1000        S
4         0            5       3    male  35.0      0      0   8.0500        S

In [36]:
dataset.isnull().sum()

Survived         0
PassengerId      0
Pclass           0
Sex              0
Age            177
SibSp            0
Parch            0
Fare             0
Embarked         2
dtype: int64

In [37]:
dataset.shape

(891, 9)

In [38]:
dataset.dropna(how='any').shape

(712, 9)

In [39]:
dataset.dropna(how='all').shape

(891, 9)

In [40]:
dataset.dropna(subset=['Age', 'Embarked'], how='all').shape

(891, 9)

In [41]:
age_mean = dataset.Age.mean()

dataset.Age.fillna(value=age_mean, inplace = True)

In [42]:
dataset.Embarked.value_counts(dropna = False)

S      644
C      168
Q       77
NaN      2
Name: Embarked, dtype: int64

In [43]:
dataset.Embarked.fillna(value="S", inplace =True)

In [44]:
dataset.Embarked.value_counts()

S    646
C    168
Q     77
Name: Embarked, dtype: int64

In [48]:
#(shortcut) to code categorical varaibles
dataset = pd.get_dummies(dataset, columns = ["Sex", "Embarked"], drop_first = True)

In [49]:
dataset.head()

,Survived,PassengerId,Pclass,Age,SibSp,Parch,Fare,Sex_male,Embarked_Q,Embarked_S
0,0,1,3,22.0,1,0,7.2500,1,0,1
1,1,2,1,38.0,1,0,71.2833,0,0,0
2,1,3,3,26.0,0,0,7.9250,0,0,1
3,1,4,1,35.0,1,0,53.1000,0,0,1
4,0,5,3,35.0,0,0,8.0500,1,0,1